## Database Connectivity

### Using DB-API Interface

`psycopg2` is the most popular and a complete implementation DB-API 2.0 for PostGreSQL database. The first step is to import the module.

In [1]:
import psycopg2

In [2]:
conn = psycopg2.connect(host = 'localhost', user = 'postgres', password = 'postgres', database = "world")

In [3]:
crsr = conn.cursor()

In [4]:
crsr.execute("select * from city")

In [6]:
crsr.description

(Column(name='id', type_code=23),
 Column(name='name', type_code=25),
 Column(name='countrycode', type_code=1042),
 Column(name='district', type_code=25),
 Column(name='population', type_code=23))

In [6]:
crsr.fetchone() # Fetch the first row

(1, 'Kabul', 'AFG', 'Kabol', 1780000)

Note that `fetchone` method has returned a tuple object.

In [7]:
crsr.fetchone() # Fetch the next row

(2, 'Qandahar', 'AFG', 'Qandahar', 237500)

Several tuples can be fetched using `fetchmany` method.

In [9]:
crsr.fetchmany(5)

[(3, 'Herat', 'AFG', 'Herat', 186800),
 (4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800),
 (5, 'Amsterdam', 'NLD', 'Noord-Holland', 731200),
 (6, 'Rotterdam', 'NLD', 'Zuid-Holland', 593321),
 (7, 'Haag', 'NLD', 'Zuid-Holland', 440900)]

Note that the result is a list of tuples.

In [8]:
cursor.fetchmany(1)

[(8, 'Utrecht', 'NLD', 'Utrecht', 234323)]

### Using sqlalchemy

In [10]:
from sqlalchemy import create_engine
engine = create_engine("postgresql://postgres:postgres@localhost/world")

In [11]:
conn2 = engine.connect()

In [13]:
result = conn2.execute("select * from country limit 5")

In [14]:
result.fetchall()

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 22720000, 45.9, Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('NLD', 'Netherlands', 'Europe', 'Western Europe', 41526.0, 1581, 15864000, 78.3, Decimal('371362.00'), Decimal('360478.00'), 'Nederland', 'Constitutional Monarchy', 'Beatrix', 5, 'NL'),
 ('ANT', 'Netherlands Antilles', 'North America', 'Caribbean', 800.0, None, 217000, 74.7, Decimal('1941.00'), None, 'Nederlandse Antillen', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 33, 'AN'),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', 28748.0, 1912, 3401200, 71.6, Decimal('3205.00'), Decimal('2500.00'), 'Shqipëria', 'Republic', 'Rexhep Mejdani', 34, 'AL'),
 ('DZA', 'Algeria', 'Africa', 'Northern Africa', 2381741.0, 1962, 31471000, 69.7, Decimal('49982.00'), Decimal('46966.00'), 'Al-Jaza\x92ir/Algérie', 'Republic', 'Abdelaziz Bouteflika', 35, 'DZ')]

## importing data from database into DataFrame

In [15]:
import pandas as pd

In [16]:
#df = pd.read_sql_table('city', conn) #This will fail as only SQLAlchemy connections are supported
df = pd.read_sql_table('city', conn2)

Above statement returns a Dataframe object. note that the necessary SQL query is implicitely generated by SQLAlchemy.

In [17]:
df.head()

   id            name countrycode       district  population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

SQLAlchemy also supports explicit SQL queries through `read_sql_query` function.

In [18]:
df2=pd.read_sql_query("select name, district from city where population > 100000", conn2)

In [19]:
df2.head()

             name       district
0           Kabul          Kabol
1        Qandahar       Qandahar
2           Herat          Herat
3  Mazar-e-Sharif          Balkh
4       Amsterdam  Noord-Holland

In [20]:
df3 = pd.read_sql_query("select city.name City, country.name Country from city, country where countrycode = 'IND' and code = 'IND'", conn2)

In [21]:
df3.head()

                 city country
0     Mumbai (Bombay)   India
1               Delhi   India
2  Calcutta [Kolkata]   India
3    Chennai (Madras)   India
4           Hyderabad   India